Revit 2026 API

# PreDocEventArgs Class

---

The class is used as base class for the arguments of any pre-event arguments that is associated to a particular Document.

SystemObject SystemEventArgs Autodesk.Revit.DB.EventsRevitEventArgs Autodesk.Revit.DB.EventsPreEventArgs Autodesk.Revit.DB.EventsPreDocEventArgs

**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PreDocEventArgs : PreEventArgs
```
```vb
Public Class PreDocEventArgs
	Inherits PreEventArgs
```
```cpp
public ref class PreDocEventArgs : public PreEventArgs
```
```fsharp
type PreDocEventArgs =
    class
        inherit PreEventArgs
    end
```

The PreDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it. (Inherited from RevitEventArgs) |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitEventArgs) |
|  | Document | The document associated with the event. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Events Namespace